In [1575]:
import pandas as pd
import numpy as np
from sklearn.impute import SimpleImputer, KNNImputer
from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import IterativeImputer

from sklearn.cluster import DBSCAN, KMeans

from sklearn.ensemble import IsolationForest

import matplotlib.pyplot as plt

data = {'A': [1, 2, np.nan, 4, 5],
        'B': [6, np.nan, 8, 9, 10],
        'C': [11, 12, 13, np.nan, 15]}
df = pd.DataFrame(data)
df

     A     B     C
0  1.0   6.0  11.0
1  2.0   NaN  12.0
2  NaN   8.0  13.0
3  4.0   9.0   NaN
4  5.0  10.0  15.0

In [1576]:
imputer = SimpleImputer(strategy='mean') # 'median', 'most_frequent', or 'constant'
df_mean = pd.DataFrame(imputer.fit_transform(df), columns=df.columns)
df_mean

     A      B      C
0  1.0   6.00  11.00
1  2.0   8.25  12.00
2  3.0   8.00  13.00
3  4.0   9.00  12.75
4  5.0  10.00  15.00

In [1577]:
data2 = {'G': ["male", "female", "male", "female", "male", np.nan]}
df2 = pd.DataFrame(data2)
df2

        G
0    male
1  female
2    male
3  female
4    male
5     NaN

In [1578]:
df2['G'] = df2['G'].fillna(value=df2['G'].mode()[0])
df2

        G
0    male
1  female
2    male
3  female
4    male
5    male

In [1579]:
knn_imputer = KNNImputer(n_neighbors=2)
df_knn = pd.DataFrame(knn_imputer.fit_transform(df), columns=df.columns)
df_knn

     A     B     C
0  1.0   6.0  11.0
1  2.0   7.0  12.0
2  3.0   8.0  13.0
3  4.0   9.0  14.0
4  5.0  10.0  15.0

In [1580]:
mice_imputer = IterativeImputer(random_state=0)
df_mice = mice_imputer.fit_transform(df)
df_mice

array([[ 1.        ,  6.        , 11.        ],
       [ 2.        ,  7.00000011, 12.        ],
       [ 2.99999994,  8.        , 13.        ],
       [ 4.        ,  9.        , 13.9999999 ],
       [ 5.        , 10.        , 15.        ]])

In [1581]:
complete_rec = df.dropna()
incomplete_rec = df[df.isnull().any(axis=1)]

In [1582]:
df.isnull().sum()

A    1
B    1
C    1
dtype: int64